News list/app/controllers/links_controller.rb

SELECT "links".* FROM "links"
---
  def index
    @links = Link.all

INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "www.flipkart.com"], ["url", "flipkart"], ["user_id", 2], ["created_at", "2015-11-28 06:11:30.876839"], ["updated_at", "2015-11-28 06:11:30.876839"]]
---
  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 2]]
---
  def upvote
    @link = Link.find(params[:id])

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 2]]
---
  def downvote
    @link = Link.find(params[:id])